In [1]:
import numpy as np
import pandas as pd

In [2]:
players = ['Allen Iverson','Steve Nash','Kobe Bryant','Michael Jordan','Lebron James','Blake Griffin']
positions = ['PG','PG','SG','SG','SF','SF']
index = list(zip(positions,players))

In [3]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('PG',  'Allen Iverson'),
            ('PG',     'Steve Nash'),
            ('SG',    'Kobe Bryant'),
            ('SG', 'Michael Jordan'),
            ('SF',   'Lebron James'),
            ('SF',  'Blake Griffin')],
           )

In [5]:
stats = np.random.randint(1,30,(6,3))
stats

array([[12, 29, 20],
       [14, 14,  5],
       [ 8, 18,  3],
       [14, 16, 27],
       [ 2, 28, 14],
       [25, 14, 23]])

In [7]:
table = pd.DataFrame(
    data = stats,
    index = index,
    columns = ['points','assists','rebounds']
)
table

                   points  assists  rebounds
PG Allen Iverson       12       29        20
   Steve Nash          14       14         5
SG Kobe Bryant          8       18         3
   Michael Jordan      14       16        27
SF Lebron James         2       28        14
   Blake Griffin       25       14        23

In [10]:
table.loc['SG']

                points  assists  rebounds
Kobe Bryant          8       18         3
Michael Jordan      14       16        27

In [17]:
table.loc['SG'].loc['Michael Jordan']

points      14
assists     16
rebounds    27
Name: Michael Jordan, dtype: int64

In [19]:
table.index.names

FrozenList([None, None])

In [20]:
table.index.names = ['position','player name']
table

                         points  assists  rebounds
position player name
PG       Allen Iverson       12       29        20
         Steve Nash          14       14         5
SG       Kobe Bryant          8       18         3
         Michael Jordan      14       16        27
SF       Lebron James         2       28        14
         Blake Griffin       25       14        23

In [21]:
table

                         points  assists  rebounds
position player name
PG       Allen Iverson       12       29        20
         Steve Nash          14       14         5
SG       Kobe Bryant          8       18         3
         Michael Jordan      14       16        27
SF       Lebron James         2       28        14
         Blake Griffin       25       14        23

In [23]:
table.sort_values('points',ascending=False)

                         points  assists  rebounds
position player name
SF       Blake Griffin       25       14        23
PG       Steve Nash          14       14         5
SG       Michael Jordan      14       16        27
PG       Allen Iverson       12       29        20
SG       Kobe Bryant          8       18         3
SF       Lebron James         2       28        14

In [24]:
table.sort_index

<bound method DataFrame.sort_index of                          points  assists  rebounds
position player name
PG       Allen Iverson       12       29        20
         Steve Nash          14       14         5
SG       Kobe Bryant          8       18         3
         Michael Jordan      14       16        27
SF       Lebron James         2       28        14
         Blake Griffin       25       14        23>

In [25]:
table

                         points  assists  rebounds
position player name
PG       Allen Iverson       12       29        20
         Steve Nash          14       14         5
SG       Kobe Bryant          8       18         3
         Michael Jordan      14       16        27
SF       Lebron James         2       28        14
         Blake Griffin       25       14        23

In [26]:
table.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 6 entries, ('PG', 'Allen Iverson') to ('SF', 'Blake Griffin')
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   points    6 non-null      int64
 1   assists   6 non-null      int64
 2   rebounds  6 non-null      int64
dtypes: int64(3)
memory usage: 625.0+ bytes

In [27]:
table.shape

(6, 3)

In [28]:
table.columns

Index(['points', 'assists', 'rebounds'], dtype='object')

In [30]:
table.dtypes

points      int64
assists     int64
rebounds    int64
dtype: object

In [33]:
table.describe()

          points    assists   rebounds
count   6.000000   6.000000   6.000000
mean   12.500000  19.833333  15.333333
std     7.635444   6.882345   9.770705
min     2.000000  14.000000   3.000000
25%     9.000000  14.500000   7.250000
50%    13.000000  17.000000  17.000000
75%    14.000000  25.500000  22.250000
max    25.000000  29.000000  27.000000

In [42]:
print('average points:',table['points'].mean()) # .median(), .max(), .std(), .min()

average points: 12.5

In [44]:
table['points'].unique()

array([12, 14,  8,  2, 25])

In [45]:
table['points'].nunique()

5

In [50]:
table['points'].value_counts()

14    2
8     1
25    1
2     1
12    1
Name: points, dtype: int64

In [52]:
df = pd.DataFrame(
    {'A':[1,2,np.nan],
    'B':[5,np.nan,np.nan],
    'C':[1,2,3]}
)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [53]:
df.isna() # to check null values that can contribute to bias

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [54]:
df.isna().sum()

A    1
B    2
C    0
dtype: int64

In [56]:
df.dropna()# will drop all rows with all null values

     A    B  C
0  1.0  5.0  1

In [57]:
df.dropna(axis=1) # will delete columns with null values

   C
0  1
1  2
2  3

In [60]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [61]:
df.fillna(value='NONE')

      A     B  C
0   1.0   5.0  1
1   2.0  NONE  2
2  NONE  NONE  3

In [75]:
df['A'].fillna(value=df['A'].mean()) # fill empy values with mean of A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [79]:
data = pd.DataFrame({
    'Company':['AMZN','AMZN','TSLA','TSLA','FCBK','FCBK'],
    'Person':['Jeff B','Bezos J','Elon M','Musk E','Zuck M','Mark Z'],
    'Sales': np.random.randint(100,1000,6)
})
data

  Company   Person  Sales
0    AMZN   Jeff B    618
1    AMZN  Bezos J    466
2    TSLA   Elon M    566
3    TSLA   Musk E    622
4    FCBK   Zuck M    794
5    FCBK   Mark Z    272

In [80]:
data.describe() # describe gives basic statistics for integers in the dataset

            Sales
count    6.000000
mean   556.333333
std    175.327883
min    272.000000
25%    491.000000
50%    592.000000
75%    621.000000
max    794.000000

In [81]:
data.describe().transpose()

       count        mean         std    min    25%    50%    75%    max
Sales    6.0  556.333333  175.327883  272.0  491.0  592.0  621.0  794.0

In [104]:
data.groupby('Company').describe() # groupby selectively shows the data under the subset 'Company'

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
AMZN      2.0  542.0  107.480231  466.0  504.0  542.0  580.0  618.0
FCBK      2.0  533.0  369.109740  272.0  402.5  533.0  663.5  794.0
TSLA      2.0  594.0   39.597980  566.0  580.0  594.0  608.0  622.0

In [92]:
data.groupby('Company').mean()

         Sales
Company
AMZN       542
FCBK       533
TSLA       594

In [101]:
data.groupby('Company').describe().transpose()['AMZN']

Sales  count      2.000000
       mean     542.000000
       std      107.480231
       min      466.000000
       25%      504.000000
       50%      542.000000
       75%      580.000000
       max      618.000000
Name: AMZN, dtype: float64

In [102]:
data.groupby('Company').describe().transpose()['AMZN'].loc['Sales'].loc['mean']

542.0